Revit 2026 API

# TableData Properties

---

The TableData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FreezeColumnsAndRows | set to true if the columns and rows should be unmovable by the slider grips |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfSections | Gets the number of items in section data array. |
|  | Width | Gets or sets the table width in feet |
|  | WidthInPixels | Gets the width of the panel schedule in logical pixels |
|  | ZoomLevel | The value of zoom level for corresponding TableView. |

#### Reference

TableData Class

Autodesk.Revit.DB Namespace